/*!------------------------------------------------
@file       ConfigDataHolder.h
@brief      
@attention  なし
--------------------------------------------------*/

#include "ConfigDataHolder.h"

/*!------------------------------------------------
@brief      デフォルトコンストラクタ
@note       クラスを構築する
@attention  なし
--------------------------------------------------*/
ConfigDataHolder::ConfigDataHolder() {
}

/*!------------------------------------------------
@brief      デフォルトデストラクタ
@note       クラスを破棄する
@attention  なし
--------------------------------------------------*/
ConfigDataHolder::~ConfigDataHolder() {
}

/*!------------------------------------------------
@brief      
@note       
@param[in]  パラメータ名  説明  [単位] (範囲)
@param[out] 
@return     なし
@attention  なし
--------------------------------------------------*/
